{
  "name": "Roy",
  "dialogues": [
    {
      "npc_id": "roy",
      "text": [
        "Hola name, bienvenid@ a Routed Inc!",
        "Yo soy Roy, amigo de Chencho y el actual Jefe de la empresa",
        "Me da gusto que hayas llegado, antes de darte un trabajo",
        "¿Por qué no pruebas a hacer algunos cables de red?",
        "Ya que será una habilidad importante para desarrollar",
        "Si caminas hacía la izquierda encontraras la mesa de cableado",
        "Donde quiera que haya una mesa de cableado puedes crear cables",
        "Prueba a hacer un cable directo, es un cable muy común",
        "Se hace ordenando los dos extremos del cable ",
        "Con el mismo estándar",
        "Se utiliza para conectar dispositivos diferentes",
        "Como una PC a un Switch o un Switch a un Router",
        "Y en la empresa los usamos para el subneteo"
      ],
      "type": "task_complete",
      "task": "meet_roy",
      "new_tasks": [],
      "requirements": [],
      "add_item": [],
      "consequences": []
    },
    {
      "npc_id": "roy",
      "text": [
        "Muy bieeen! Pon atención a la calidad de los cables",
        "De eso depende la paga en tus trabajos de subneteo",
        "Ahora, prueba a hacer un cable cruzado",
        "Este cable intercala los estándares",
        "Por un lado tiene el A y en el otro el B",
        "No importa el orden de los estándares, pero sí que sean distintos",
        "Este cable se usa para conectar dispositivos iguales",
        "Como dos Switches o dos Routers",
        "Crea uno en la mesa de cableado"
      ],
      "type": "task_complete",
      "task": "roy_straight_cable",
      "new_tasks": [],
      "requirements": [],
      "add_item": [],
      "consequences": []
    },
    {
      "npc_id": "roy",
      "text": [
        "Perfecto! Veo que tu habilidad para hacer cables es excelente",
        "Ahora, tu primer trabajo será en el pueblo",
        "Dirígete a los departamentos de la empresa",
        "Están a lado de la tienda del pueblo",
        "Es un trabajo de subneteo, Ale te dará mas detalles"
      ],
      "type": "task_complete",
      "task": "roy_crossover_cable",
      "new_tasks": [],
      "requirements": [],
      "add_item": [],
      "consequences": []
    },
    {
      "npc_id": "roy",
      "text": [
        "Ale me dijo que te fue de maravilla",
        "Muchas felicidades name",
        "Nuestra meta en esta empresa es conectar toda la ciudad",
        "Para eso necesitamos subnetear y enrutar todos los lugares",
        "Sal y explora el pueblo y la ciudad",
        "Seguro habrá muchos que necesiten de nuestro trabajo"
      ],
      "type": "task_complete",
      "task": "roy_subnetting_reception",
      "new_tasks": [],
      "requirements": [],
      "add_item": [],
      "consequences": []
    },
    {
      "npc_id": "roy",
      "text": [
        "Espero que te este yendo bien con todos esos trabajos de redes"
      ],
      "type": "generic",
      "task": "",
      "new_tasks": [],
      "requirements": [],
      "add_item": [],
      "consequences": []
    }
  ],
  "default_zone": "company",
  "schedule": {
    "0": "company",
    "1": "company",
    "2": "company",
    "3": "company",
    "4": "company",
    "5": "company",
    "6": "company"
  },
  "consequences": []
}